* ob-haskell-ng

[[http://melpa.org/#/ob-typescript][http://melpa.org/packages/ob-haskell-ng-badge.svg]]

This org-mode babel support for execution of Haskell code blocks using [[https://gitlab.com/magus/haskell-ng-mode][haskell-ng-mode]].

** Install

*** Requirement

You need to have ghc installed to use this extension.

*** ToDo MELPA
With setting up [[http://melpa.org][MELPA]], use =M-x package-install ob-haskell-ng.

*** Manually

#+BEGIN_SRC emacs-lisp
(add-to-list 'load-path "/path/to/ob-haskell-ng.el")
(require 'ob-haskell-ng)
#+END_SRC

** Configure

** Examples

#+BEGIN_SRC haskell-ng :results output
putStrLn "Hello World!"
#+end_src

#+RESULTS:
: Resolving dependencies...
: Build profile: -w ghc-9.4.7 -O1
: In order, the following will be built (use -v for more details):
:  - fake-package-0 (lib) (first run)
: Configuring library for fake-package-0..
: Warning: No exposed modules
: GHCi, version 9.4.7: https://www.haskell.org/ghc/  :? for help
: Loaded GHCi configuration from /var/folders/h1/yhtz6g614_g999nh_tb4gj600000gn/T/cabal-repl.-29554/setcwd.ghci
: Hello World!
